Revit 2024 API
InitialIlluminanceIntensity Class
 This class encapsulates initial illuminance intensity calculation.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class InitialIlluminanceIntensity : InitialIntensity
Visual Basic
Public Class InitialIlluminanceIntensity _
	Inherits InitialIntensity
Visual C++
public ref class InitialIlluminanceIntensity : public InitialIntensity
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialIntensity
 Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity
See Also
InitialIlluminanceIntensity Members
Autodesk.Revit.DB.Lighting Namespace